app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def new
  @url = Url.new
  @urls = Url.all

INSERT INTO "urls" ("original_url", "short_url", "token", "created_at", "updated_at") VALUES ('http://127.0.0.1:3000/urls/new', 'JOcABD8K', '1e689187fbff60b60922', '2025-09-18 14:17:10.537840', '2025-09-18 14:17:10.537840') RETURNING "id"
---
  def create
    @url = Url.new(url_params)
    if @url.save

SELECT "urls".* FROM "urls" WHERE "urls"."id" = 1 LIMIT 1
---
  def show
    @url = Url.find(params[:id])

SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = 'JOcABD8K' LIMIT 1
---
  def redirect
    url = Url.find_by(short_url: params[:short_url])