app/models/url.rb

SELECT 1 AS one FROM "urls" WHERE "urls"."short_url" = 'RVGJpfJE' LIMIT 1
---
  def generate_short_url
    self.short_url ||= loop do
      random_url = SecureRandom.urlsafe_base64(6)
      break random_url unless Url.exists?(short_url: random_url)